---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSwitchToCurtainWall
source: html/b54800f2-6979-8a80-80cc-3b1bae28831b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSwitchToCurtainWall Property

Can't switch type to Curtain Wall after Edit Elevation Profile.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSwitchToCurtainWall { get; }
```